Revit 2027 API
DistributionSysTypeSet.Contains Method
Tests for the existence of a DistributionSys type within the set.
Namespace: Autodesk.Revit.DB.Electrical
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public virtual bool Contains(
	DistributionSysType item
)
Public Overridable Function Contains (
	item As DistributionSysType
) As Boolean
public:
virtual bool Contains(
	DistributionSysType^ item
)
abstract Contains :
        item : DistributionSysType -> bool
override Contains :
        item : DistributionSysType -> bool
Parameters
item DistributionSysType
The DistributionSys type to be searched for.
Return Value
Boolean
The Contains method returns True if the DistributionSys type is within the set, otherwise False.
See Also
Reference
DistributionSysTypeSet Class
Autodesk.Revit.DB.Electrical Namespace